zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
/***********************************************************************************************************************
*
* Changes the Host controller SD clock.
*
* sdxx                  - Pointer to SHDC/SDIO common structure
* frequency             - The frequency in Hz (pointer). This variable will be updated with actual frequency achieved
*   upon function return.
* lv_signaling          - Support 1.8V
* negotiate             - Whether new frequency value needs to be negotiated with the card
*
***********************************************************************************************************************/
static cy_rslt_t _cyhal_sdxx_sdcardchangeclock(_cyhal_sdxx_t *sdxx, uint32_t *frequency, bool lv_signaling, bool negotiate)
{
    CY_ASSERT(NULL != sdxx);
    CY_ASSERT(NULL != frequency);
    CY_ASSERT(NULL != sdxx->base);

    cyhal_clock_t most_suitable_hf_source;
    uint32_t most_suitable_div = 0;
    uint32_t actual_freq = 0;
    uint32_t hf_freq = 0;
    cy_rslt_t ret = CY_RSLT_SUCCESS;

    if (sdxx->clock_owned)
    {
        /*  Find most suitable HF clock source and divider for it to achieve closest frequency to desired.
        *   No clock settings are being changed here. */
        ret = _cyhal_utils_find_hf_source_n_divider(&(sdxx->clock), *frequency, NULL, _cyhal_sdxx_find_best_div,
                                &most_suitable_hf_source, &most_suitable_div);
    }
    else
    {
        ret = _cyhal_sdxx_find_best_div(cyhal_clock_get_frequency(&(sdxx->clock)), *frequency, NULL, false, &most_suitable_div);
    }

    if (CY_RSLT_SUCCESS == ret)
    {
        /* If clock is owned, we just found most suitable hf source for it. if not - we need to work with the one provided */
        hf_freq = cyhal_clock_get_frequency(sdxx->clock_owned ? &most_suitable_hf_source : &(sdxx->clock));
        actual_freq = hf_freq / most_suitable_div;

        ret = _cyhal_sdxx_update_hw_clock_config(sdxx, actual_freq, lv_signaling, negotiate);
    }

    if (sdxx->clock_owned)
    {
        if (CY_RSLT_SUCCESS == ret)
        {
            /* Switch to most suitable HF clock source */
            ret = cyhal_clock_set_source(&(sdxx->clock), &most_suitable_hf_source);
        }

        if (CY_RSLT_SUCCESS == ret)
        {
            /* SDHC internal divider will be configured instead. */
            ret = cyhal_clock_set_divider(&(sdxx->clock), 1);
        }
    }

    if (!sdxx->is_sdio)
    {
        ((cyhal_sdhc_t *) sdxx->obj)->block_source_freq_hz = hf_freq;
    }

    if (CY_RSLT_SUCCESS == ret)
    {
        Cy_SD_Host_DisableSdClk(sdxx->base);
        ret = (cy_rslt_t)Cy_SD_Host_SetSdClkDiv(sdxx->base, most_suitable_div >> 1);
        Cy_SD_Host_EnableSdClk(sdxx->base);
    }

    if (CY_RSLT_SUCCESS == ret)
    {
        *frequency = actual_freq;
    }

    return ret;
}

/*******************************************************************************
*
* Waits for the command complete event.
*
* sdxx                     - Pointer to SHDC/SDIO common structure
* time_used_ms             - Pointer to uint32_t value for the total time taken for the function.
*
*******************************************************************************/
static cy_en_sd_host_status_t _cyhal_sdxx_pollcmdcomplete(_cyhal_sdxx_t *sdxx, uint32_t *time_used_ms)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t retry  = _CYHAL_SDHC_RETRY_TIMES * _CYHAL_SDIO_CMD_CMPLT_DELAY_US;

    while (retry > 0UL)
    {
        /* Command complete */
        if (CY_SD_HOST_CMD_COMPLETE == (CY_SD_HOST_CMD_COMPLETE & Cy_SD_Host_GetNormalInterruptStatus(sdxx->base)))
        {
            sdxx->data_transfer_status &= ~_CYHAL_SDXX_WAIT_CMD_COMPLETE;

            /* Clear interrupt flag */
            Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, CY_SD_HOST_CMD_COMPLETE);

            ret = CY_SD_HOST_SUCCESS;
            break;
        }

        cyhal_system_delay_us(1);
        retry--;
    }
    if (time_used_ms != NULL)
    {
        *time_used_ms = (((_CYHAL_SDHC_RETRY_TIMES * _CYHAL_SDIO_CMD_CMPLT_DELAY_US) - retry) / 1000);
    }

    return ret;
}


/*******************************************************************************
*
* Waits for the transfer complete event.
*
* sdxx                  - Pointer to SHDC/SDIO common structure
* delay                 - The delay timeout for one block transfer.
*
* return If the sdxx pointer is NULL, returns error.
*
*******************************************************************************/
static cy_en_sd_host_status_t _cyhal_sdxx_polltransfercomplete(_cyhal_sdxx_t *sdxx, const uint16_t delay)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_TIMEOUT;
    uint32_t               retry = _CYHAL_SDHC_RW_RETRY_CYCLES;
    uint32_t               status = 0UL;

    while ((CY_SD_HOST_ERROR_TIMEOUT == ret) && (retry-- > 0U))
    {
        /* We check for either the interrupt register or the byte set in the _cyhal_sdxx_irq_handler
         * to avoid a deadlock in the case where if an API that is polling is called from an ISR
         * and its priority is higher than the priority of the _cyhal_sdxx_irq_handler thus not allowing
         * the signalling byte to be set.
         */
        status = Cy_SD_Host_GetNormalInterruptStatus(sdxx->base);
        if (CY_SD_HOST_XFER_COMPLETE == (CY_SD_HOST_XFER_COMPLETE & status) ||
            (sdxx->is_sdio ? !_cyhal_sdio_is_busy(sdxx) : !_cyhal_sdhc_is_busy(sdxx)))
        {
            /* Transfer complete */
            ret = CY_SD_HOST_SUCCESS;
            break;
        }
        cyhal_system_delay_us(delay);
    }

    return ret;
}

// Indicates that a sync transfer is in process
static void _cyhal_sdxx_setup_smphr(_cyhal_sdxx_t *sdxx)
{
#if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
    uint8_t block_num = sdxx->resource.block_num;
    bool in_isr = (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;
    if (!in_isr)
    {
        cy_rslt_t ret = CY_RSLT_SUCCESS;
        if (_CYHAL_SDXX_SEMA_NOT_INITED == _cyhal_sdxx_semaphore_status[block_num])
        {
            /* Semaphore is used to make transfer complete event wait process be more RTOS-friendly.
            *  It cannot be initialized in ISR context (some of mbed layers are initializing sdio in ISR conext),
            *  so we have to do it in scope of transfer functions. */
            /* Assert that we are not in an ISR */
            CY_ASSERT((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) == 0);
            ret = cy_rtos_init_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[block_num]), 1, 0);
        }
        else if (_CYHAL_SDXX_SEMA_SET == _cyhal_sdxx_semaphore_status[block_num])
        {
            /*  Situation, when semaphore was set, but _cyhal_sdxx_waitfor_transfer_complete function was not
            *   used for the transfer to get the semaphore (async transfer). Clearing the semaphore in order
            *   to prepare it for another transfer.  */
            ret = cy_rtos_get_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[block_num]), 500, in_isr);
        }
        if (CY_RSLT_SUCCESS == ret)
        {
            _cyhal_sdxx_semaphore_status[block_num] = _CYHAL_SDXX_SEMA_USED;
        }
    }
    else if (_CYHAL_SDXX_SEMA_NOT_INITED != _cyhal_sdxx_semaphore_status[block_num])
    {
        _cyhal_sdxx_semaphore_status[block_num] = _CYHAL_SDXX_SEMA_NOT_USED;
    }
#else
    // We don't need to do anything special if we're not in an RTOS context
    CY_UNUSED_PARAMETER(sdxx);
#endif
}

static cy_rslt_t _cyhal_sdxx_waitfor_transfer_complete(_cyhal_sdxx_t *sdxx)
{
    /* When using an RTOS if a sdxx api (read or write) is called from and ISR in
     * in certain RTOSes cy_rtos_get_semaphore returns immediately without blocking. So we can
     * either busy wait around the semaphore being set in the ISR or use the normal polling method
     * we use in the non-RTOS case. For simplicity and to avoid the calling ISR from depending on
     * the SDXX ISR priority we use the normal polling method.
     */
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
    bool in_isr = (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;
    if ((!in_isr) && _cyhal_sdxx_is_smfr_ready_for_get(sdxx))
    {
        ret = cy_rtos_get_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[sdxx->resource.block_num]), 500, in_isr);
        if (CY_RSLT_SUCCESS == ret)
        {
            _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_NOT_USED;
        }
    }
    else
    {
    #endif
        ret = (cy_rslt_t)_cyhal_sdxx_polltransfercomplete(sdxx, _CYHAL_SDHC_RW_TIMEOUT_US);
    #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
    }
    #endif

    return ret;
}

static void _cyhal_sdhc_irq_handler(void)
{
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_sdhc_get_block_from_irqn(irqn);
    SDHC_Type *blockAddr = _CYHAL_SDHC_BASE_ADDRESSES[block];
    _cyhal_sdxx_t *sdxx = (_cyhal_sdxx_t*) _cyhal_sdxx_config_structs[block];

    uint32_t interruptStatus = Cy_SD_Host_GetNormalInterruptStatus(blockAddr);
    uint32_t userInterruptStatus = interruptStatus & sdxx->irq_cause;
    cyhal_sdhc_event_t user_events = (0 != userInterruptStatus) ? (cyhal_sdhc_event_t)_cyhal_utils_convert_flags(
        _cyhal_sdhc_event_map, sizeof(_cyhal_sdhc_event_map) / sizeof(uint32_t), userInterruptStatus) :
        (cyhal_sdhc_event_t)0;

    /*  Some parts of SDHost PDL and SDHC HAL drivers are sending SD commands and polling interrupt status
    *   until CY_SD_HOST_CMD_COMPLETE occurs. Thats why we can't clear CY_SD_HOST_CMD_COMPLETE interrupt status
    *   and code below prevents _cyhal_sdhc_irq_handler from being continuosly called because of uncleared
    *   CY_SD_HOST_CMD_COMPLETE event. */

    if (interruptStatus & Cy_SD_Host_GetNormalInterruptMask(blockAddr) & CY_SD_HOST_CMD_COMPLETE)
    {
        /* Disabling command complete interrupt mask */
        Cy_SD_Host_SetNormalInterruptMask(sdxx->base,
                Cy_SD_Host_GetNormalInterruptMask(sdxx->base) & (uint32_t) ~CY_SD_HOST_CMD_COMPLETE);
        sdxx->data_transfer_status &= ~_CYHAL_SDXX_WAIT_CMD_COMPLETE;
    }

    /*  During SDHost PDL driver operation, CY_SD_HOST_XFER_COMPLETE status can occur and driver
    *   is polling Cy_SD_Host_GetNormalInterruptStatus while waiting for it. Because of this
    *   it is critical to have CY_SD_HOST_XFER_COMPLETE event mask disabled and only enabled during
    *   transfers. Write / Read SDHC/SDIO HAL functions are taking care of enabling CY_SD_HOST_XFER_COMPLETE
    *   mask before transfer while code below disables it. */

    /* CY_SD_HOST_XFER_COMPLETE occured and appropriate bit in interrupt mask is enabled */
    if (interruptStatus & Cy_SD_Host_GetNormalInterruptMask(blockAddr) & CY_SD_HOST_XFER_COMPLETE)
    {
        /* Clearing transfer complete status */
        Cy_SD_Host_ClearNormalInterruptStatus(blockAddr, CY_SD_HOST_XFER_COMPLETE);

        sdxx->data_transfer_status &= ~_CYHAL_SDXX_WAIT_XFER_COMPLETE;

        #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
        if (_cyhal_sdxx_is_smfr_ready_for_set(sdxx))
        {
            cy_rtos_set_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[sdxx->resource.block_num]), true);
            _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_SET;
        }
        #endif /* CY_RTOS_AWARE or COMPONENT_RTOS_AWARE defined */

        /* Disabling transfer complete interrupt mask */
        Cy_SD_Host_SetNormalInterruptMask(sdxx->base,
                Cy_SD_Host_GetNormalInterruptMask(sdxx->base) & (uint32_t) ~CY_SD_HOST_XFER_COMPLETE);
    }

    if ((sdxx->callback_data.callback != NULL) && (0 != user_events))
    {
        cyhal_sdhc_event_callback_t callback = (cyhal_sdhc_event_callback_t) sdxx->callback_data.callback;

        /* Call registered callbacks here */
        (callback) (sdxx->callback_data.callback_arg, user_events);
    }

    /*  Cannot clear cmd complete interrupt, as it is being polling-waited by many SD Host functions.
    *   It is expected to be cleared by mentioned polling functions. */
    userInterruptStatus &= (uint32_t) ~CY_SD_HOST_CMD_COMPLETE;

    /* Clear only handled events */
    Cy_SD_Host_ClearNormalInterruptStatus(blockAddr, userInterruptStatus);
}

static void _cyhal_sdio_irq_handler(void)
{
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_sdhc_get_block_from_irqn(irqn);
    SDHC_Type *blockAddr = _CYHAL_SDHC_BASE_ADDRESSES[block];
    _cyhal_sdxx_t *sdxx = (_cyhal_sdxx_t*) _cyhal_sdxx_config_structs[block];

    uint32_t interruptStatus = Cy_SD_Host_GetNormalInterruptStatus(blockAddr);
    uint32_t userInterruptStatus = interruptStatus & sdxx->irq_cause;
    uint32_t normalInterruptMask = Cy_SD_Host_GetNormalInterruptMask(blockAddr);

    /*  Some parts of SDHost PDL and SDIO HAL drivers are sending SD commands and polling interrupt status
    *   until CY_SD_HOST_CMD_COMPLETE occurs. Thats why we can't clear CY_SD_HOST_CMD_COMPLETE interrupt status
    *   and code below prevents _cyhal_sdhc_irq_handler from being continuosly called because of uncleared
    *   CY_SD_HOST_CMD_COMPLETE event. */

