zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
    if (interruptStatus & normalInterruptMask & CY_SD_HOST_CMD_COMPLETE)
    {
        /* Disabling command complete interrupt mask */
        Cy_SD_Host_SetNormalInterruptMask(sdxx->base,
                Cy_SD_Host_GetNormalInterruptMask(sdxx->base) & (uint32_t) ~CY_SD_HOST_CMD_COMPLETE);
        sdxx->data_transfer_status &= ~_CYHAL_SDXX_WAIT_CMD_COMPLETE;
    }

    /*  During SDHost PDL driver operation, CY_SD_HOST_XFER_COMPLETE status can occur and driver
    *   is polling Cy_SD_Host_GetNormalInterruptStatus while waiting for it. Because of this
    *   it is critical to have CY_SD_HOST_XFER_COMPLETE event mask disabled and only enabled during
    *   transfers. Write / Read SDHC/SDIO HAL functions are taking care of enabling CY_SD_HOST_XFER_COMPLETE
    *   mask before transfer while code below disables it. */

    /*  CY_SD_HOST_XFER_COMPLETE occured and appropriate bit in interrupt mask is enabled */
    if (interruptStatus & normalInterruptMask & CY_SD_HOST_XFER_COMPLETE)
    {
        sdxx->data_transfer_status &= ~_CYHAL_SDXX_WAIT_XFER_COMPLETE ;
        Cy_SD_Host_ClearNormalInterruptStatus(blockAddr, CY_SD_HOST_XFER_COMPLETE);
        #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
        if (_cyhal_sdxx_is_smfr_ready_for_set(sdxx))
        {
            cy_rtos_set_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[block]), true);
            _cyhal_sdxx_semaphore_status[block] = _CYHAL_SDXX_SEMA_SET;
        }
        #endif /* CY_RTOS_AWARE or COMPONENT_RTOS_AWARE defined */

        /* Disabling transfer complete interrupt mask */
        Cy_SD_Host_SetNormalInterruptMask(sdxx->base,
                Cy_SD_Host_GetNormalInterruptMask(sdxx->base) & (uint32_t) ~CY_SD_HOST_XFER_COMPLETE);

        /* Transfer is no more active. If card interrupt was not yet enabled after it was disabled in
        *   interrupt handler, enable it.
        */
        uint32_t interrupt_enable_status = Cy_SD_Host_GetNormalInterruptEnable(sdxx->base);
        if ((interrupt_enable_status & CY_SD_HOST_CARD_INTERRUPT) == 0)
        {
            Cy_SD_Host_SetNormalInterruptEnable(sdxx->base, (interrupt_enable_status | CY_SD_HOST_CARD_INTERRUPT));
        }
    }

    if (sdxx->callback_data.callback != NULL && userInterruptStatus > 0)
    {
        cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) sdxx->callback_data.callback;
        /* Call registered callbacks here */
        (callback)(sdxx->callback_data.callback_arg, (cyhal_sdio_event_t) userInterruptStatus);
    }

    /*  Cannot clear cmd complete interrupt, as it is being polling-waited by many SD Host functions.
    *   It is expected to be cleared by mentioned polling functions. */
    userInterruptStatus &= (uint32_t) ~CY_SD_HOST_CMD_COMPLETE;

    /* Clear only handled events */
    Cy_SD_Host_ClearNormalInterruptStatus(blockAddr, userInterruptStatus);

    /* To clear Card Interrupt need to disable Card Interrupt Enable bit.
    *  The Card Interrupt is enabled after the current transfer is complete
    */
    if (0U != (interruptStatus & CY_SD_HOST_CARD_INTERRUPT))
    {
        uint32_t interruptMask = Cy_SD_Host_GetNormalInterruptEnable(blockAddr);
        interruptMask &= (uint32_t) ~CY_SD_HOST_CARD_INTERRUPT;
        /* Disable Card Interrupt */
        Cy_SD_Host_SetNormalInterruptEnable(blockAddr, interruptMask);
    }
}

/* Software reset of SDHC block data and command circuits */
static void _cyhal_sdxx_reset(_cyhal_sdxx_t *sdxx)
{
    CY_ASSERT(NULL != sdxx);
    CY_ASSERT(NULL != sdxx->base);

    /* Usually it is enough ~ 15 us for reset to complete on 100 MHz HF clock for any supported compiler / optimization.
    *  Making max time much greater to cover different frequencies and unusual cases. Timeout and SW_RST_R check
    *  will be removed after DRIVERS-5769 is resolved. */
    uint32_t timeout_us = 1000;

    sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    Cy_SD_Host_SoftwareReset(sdxx->base, CY_SD_HOST_RESET_DATALINE);
    Cy_SD_Host_SoftwareReset(sdxx->base, CY_SD_HOST_RESET_CMD_LINE);

    /* This wait loop will be removed after DRIVERS-5769 resolved. */
    while ((sdxx->base->CORE.SW_RST_R != 0) && (timeout_us-- != 0))
    {
        cyhal_system_delay_us(1);
    }

    /* Reset was not cleared by SDHC IP Block. Something wrong. Are clocks enabled? */
    CY_ASSERT(timeout_us != 0);
}

static cy_rslt_t _cyhal_sdhc_init_common_hw(cyhal_sdhc_t *obj, const cyhal_sdhc_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);

    cy_rslt_t result = CY_RSLT_SUCCESS;

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    sdxx->obj = obj;
    sdxx->is_sdio = false;

    /* Configuration is provided by device configurator */
    sdxx->dc_configured = (cfg->resource != NULL);
    sdxx->dma_type = cfg->host_config->dmaType;

    if (sdxx->dc_configured && (cfg->host_config->dmaType != CY_SD_HOST_DMA_ADMA2))
    {
        /* SDHC HAL does not support non-CY_SD_HOST_DMA_ADMA2 DMA configurations */
        return CYHAL_SDHC_RSLT_ERR_UNSUPPORTED;
    }

    sdxx->base = NULL;
    sdxx->resource.type = CYHAL_RSC_INVALID;

    sdxx->pin_clk = CYHAL_NC_PIN_VALUE;
    sdxx->pin_cmd = CYHAL_NC_PIN_VALUE;
    obj->pin_data[0] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[1] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[2] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[3] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[4] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[5] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[6] = CYHAL_NC_PIN_VALUE;
    obj->pin_data[7] = CYHAL_NC_PIN_VALUE;
    obj->pin_card_detect = CYHAL_NC_PIN_VALUE;
    sdxx->pin_io_vol_sel = CYHAL_NC_PIN_VALUE;
    obj->pin_card_pwr_en = CYHAL_NC_PIN_VALUE;
    obj->pin_card_mech_write_prot = CYHAL_NC_PIN_VALUE;
    obj->pin_led_ctrl = CYHAL_NC_PIN_VALUE;
    obj->pin_emmc_reset = CYHAL_NC_PIN_VALUE;

    obj->cd_gpio_cb_enabled = false;
    sdxx->clock_owned = false;
    sdxx->low_voltage_io_set = false;

    cyhal_gpio_t data[8];
    memcpy(data, cfg->gpios.data, sizeof(data));

    cyhal_gpio_t cmd = cfg->gpios.cmd;
    cyhal_gpio_t clk = cfg->gpios.clk;
    cyhal_gpio_t card_detect = cfg->gpios.card_detect;
    cyhal_gpio_t io_volt_sel = cfg->gpios.io_volt_sel;
    cyhal_gpio_t card_pwr_en = cfg->gpios.card_pwr_en;
    cyhal_gpio_t card_mech_write_prot = cfg->gpios.card_mech_write_prot;
    cyhal_gpio_t led_ctrl = cfg->gpios.led_ctrl;
    cyhal_gpio_t emmc_reset = cfg->gpios.emmc_reset;

    obj->data_timeout_tout = _CYHAL_SDHC_TRANSFER_TIMEOUT;
    obj->data_timeout_card_clocks_user = 0;
    obj->data_timeout_auto_reconfig = false;

