zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
        sdxx->irq_cause = 0UL;
        sdxx->callback_data.callback = NULL;
        sdxx->callback_data.callback_arg = NULL;
        _cyhal_sdxx_config_structs[sdxx->resource.block_num] = sdxx;

        IRQn_Type irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
        cy_stc_sysint_t irqCfg = { irqn, CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, _cyhal_sdhc_irq_handler);
        NVIC_EnableIRQ(irqn);

        result = (cy_rslt_t)Cy_SD_Host_Init(sdxx->base, cfg->host_config, &(sdxx->context));
    }

    if(result == CY_RSLT_SUCCESS)
    {
        sdxx->pm_transition_pending = false;
        sdxx->pm_callback_data.callback = &_cyhal_sdhc_syspm_callback;
        sdxx->pm_callback_data.states =
                (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        sdxx->pm_callback_data.next = NULL;
        sdxx->pm_callback_data.args = sdxx;
        /* The CYHAL_SYSPM_BEFORE_TRANSITION mode cannot be ignored because the PM handler
            * calls the PDL deep-sleep callback that disables the block in this mode before transitioning.
            */
        sdxx->pm_callback_data.ignore_modes = (cyhal_syspm_callback_mode_t)0;

        _cyhal_syspm_register_peripheral_callback(&(sdxx->pm_callback_data));
    }

    if (result != CY_RSLT_SUCCESS)
    {
        cyhal_sdhc_free(obj);
    }

    return result;
}

cy_rslt_t cyhal_sdhc_init_hw(cyhal_sdhc_t *obj,
                        const cyhal_sdhc_config_t *config,
                        cyhal_gpio_t cmd,
                        cyhal_gpio_t clk,
                        cyhal_gpio_t data0,
                        cyhal_gpio_t data1,
                        cyhal_gpio_t data2,
                        cyhal_gpio_t data3,
                        cyhal_gpio_t data4,
                        cyhal_gpio_t data5,
                        cyhal_gpio_t data6,
                        cyhal_gpio_t data7,
                        cyhal_gpio_t card_detect,
                        cyhal_gpio_t io_volt_sel,
                        cyhal_gpio_t card_pwr_en,
                        cyhal_gpio_t card_mech_write_prot,
                        cyhal_gpio_t led_ctrl,
                        cyhal_gpio_t emmc_reset,
                        cyhal_clock_t *block_clk)
{
    CY_ASSERT(NULL != obj);

    cy_stc_sd_host_init_config_t sd_host_config = {
        .emmc = config->isEmmc,
        .dmaType = CY_SD_HOST_DMA_ADMA2,
        .enableLedControl = config->enableLedControl
    };

    const cyhal_sdhc_configurator_t cfg = {
        /* Resource will be reserved and assigned in HAL flow */
        .resource = NULL,
        .host_config = &sd_host_config,
        .card_config = NULL,
        .clock = block_clk,
        .gpios = {
            .cmd = cmd, .clk = clk, .data[0] = data0, .data[1] = data1, .data[2] = data2, .data[3] = data3,
            .data[4] = data4, .data[5] = data5, .data[6] = data6, .data[7] = data7, .card_detect = card_detect,
            .io_volt_sel = io_volt_sel, .card_pwr_en = card_pwr_en, .card_mech_write_prot = card_mech_write_prot,
            .led_ctrl = led_ctrl, .emmc_reset = emmc_reset
        }
    };

    obj->low_voltage_io_desired = config->lowVoltageSignaling;
    obj->bus_width = config->busWidth;

    return _cyhal_sdhc_init_common_hw(obj, &cfg);
}

static cy_rslt_t _cyhal_sdhc_init_card_common(cyhal_sdhc_t *obj, cy_stc_sd_host_sd_card_config_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    /* Initialize the card */
    cy_rslt_t result = (cy_rslt_t)Cy_SD_Host_InitCard(sdxx->base, cfg, &(sdxx->context));

    if (CY_RSLT_SUCCESS == result)
    {
        /* If clock is owned by driver, update SD Card frequency to be 25 Mhz. Otherwise, configure interface clock
        *   for passthrough (to be same as SDHC block source clock) */
        result = cyhal_sdhc_set_frequency(obj,
                        sdxx->clock_owned ? _CYHAL_SDXX_MHZ(25) : cyhal_clock_get_frequency(&(sdxx->clock)), true);
    }

    if ((CY_RSLT_SUCCESS == result) && (sdxx->emmc))
    {
        uint8_t ext_csd[_CYHAL_SDHC_EXTCSD_SIZE] = { 0UL };
        if (CY_RSLT_SUCCESS == (cy_rslt_t)Cy_SD_Host_GetExtCsd(sdxx->base, (uint32_t *)ext_csd, &(sdxx->context)))
        {
            /* Get GENERIC_CMD6_TIME [248] of the EXTCSD register */
            obj->emmc_generic_cmd6_time_ms =
                   (uint16_t) (_CYHAL_SDHC_EMMC_CMD6_TIMEOUT_MULT * ext_csd[_CYHAL_SDHC_EXTCSD_GENERIC_CMD6_TIME]);
        }
    }
    return result;
}

cy_rslt_t cyhal_sdhc_init_card(cyhal_sdhc_t *obj)
{
    cy_en_sd_host_card_type_t card_type;
    cy_en_sd_host_card_capacity_t card_capacity;
    uint32_t rca = 0;

    cy_stc_sd_host_sd_card_config_t sd_card_config = {
        .lowVoltageSignaling = obj->low_voltage_io_desired,
        .busWidth = _cyhal_sdhc_buswidth_hal_to_pdl(obj->bus_width),
        .cardType = &card_type,
        .rca = &rca,
        .cardCapacity = &card_capacity
    };

    return _cyhal_sdhc_init_card_common(obj, &sd_card_config);
}

cy_rslt_t cyhal_sdhc_init(cyhal_sdhc_t *obj,
                          const cyhal_sdhc_config_t *config,
                          cyhal_gpio_t cmd,
                          cyhal_gpio_t clk,
                          cyhal_gpio_t data0,
                          cyhal_gpio_t data1,
                          cyhal_gpio_t data2,
                          cyhal_gpio_t data3,
                          cyhal_gpio_t data4,
                          cyhal_gpio_t data5,
                          cyhal_gpio_t data6,
                          cyhal_gpio_t data7,
                          cyhal_gpio_t card_detect,
                          cyhal_gpio_t io_volt_sel,
                          cyhal_gpio_t card_pwr_en,
                          cyhal_gpio_t card_mech_write_prot,
                          cyhal_gpio_t led_ctrl,
                          cyhal_gpio_t emmc_reset,
                          cyhal_clock_t *block_clk)
{
    cy_rslt_t result = cyhal_sdhc_init_hw(obj, config, cmd, clk, data0, data1, data2, data3, data4, data5, data6,
            data7, card_detect, io_volt_sel, card_pwr_en, card_mech_write_prot, led_ctrl, emmc_reset, block_clk);

