zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
    /* Initialize card */
    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_sdhc_init_card(obj);
    }

    return result;
}

cy_rslt_t cyhal_sdhc_init_cfg(cyhal_sdhc_t *obj, const cyhal_sdhc_configurator_t *cfg)
{
    obj->low_voltage_io_desired = cfg->card_config->lowVoltageSignaling;
    obj->bus_width = _cyhal_sdhc_buswidth_pdl_to_hal(cfg->card_config->busWidth);

    return _cyhal_sdhc_init_common_hw(obj, cfg);
}

void cyhal_sdhc_free(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (NULL != sdxx->base)
    {
        IRQn_Type irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
        NVIC_DisableIRQ(irqn);
        #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
        if (_CYHAL_SDXX_SEMA_NOT_INITED != _cyhal_sdxx_semaphore_status[sdxx->resource.block_num])
        {
            cy_rtos_deinit_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[sdxx->resource.block_num]));
            _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_NOT_INITED;
        }
        #endif /* CY_RTOS_AWARE or COMPONENT_RTOS_AWARE defined */

        Cy_SD_Host_DeInit(sdxx->base);
        _cyhal_sdxx_config_structs[sdxx->resource.block_num] = NULL;
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;

        if (!sdxx->dc_configured)
        {
            cyhal_hwmgr_free(&(sdxx->resource));
        }
        sdxx->base = NULL;

        _cyhal_syspm_unregister_peripheral_callback(&(sdxx->pm_callback_data));
    }

    if (sdxx->resource.type != CYHAL_RSC_INVALID)
    {
        sdxx->resource.type = CYHAL_RSC_INVALID;
    }

    if (sdxx->clock_owned)
    {
        cyhal_clock_free(&(sdxx->clock));
        sdxx->clock_owned = false;
    }

    if (!sdxx->dc_configured)
    {
        /* Free pins */
        _cyhal_utils_release_if_used(&(sdxx->pin_cmd));
        _cyhal_utils_release_if_used(&(sdxx->pin_clk));
        #if _CYHAL_SDHC_DATA8_PRESENT
            const uint8_t max_idx = 8;
        #else
            const uint8_t max_idx = 4;
        #endif
        for (uint8_t i = 0; i < max_idx; i++)
        {
            _cyhal_utils_release_if_used(&(obj->pin_data[i]));
        }
    }

    #if _CYHAL_SDHC_CARD_DETECT_PRESENT
    if ((obj->cd_gpio_cb_enabled) && (CYHAL_NC_PIN_VALUE != obj->pin_card_detect))
    {
        cyhal_gpio_enable_event(obj->pin_card_detect, CYHAL_GPIO_IRQ_BOTH, CYHAL_ISR_PRIORITY_DEFAULT, false);
        cyhal_gpio_register_callback(obj->pin_card_detect, NULL);
        obj->cd_gpio_cb_enabled = false;
    }
    if (!sdxx->dc_configured)
    {
        _cyhal_utils_release_if_used(&(obj->pin_card_detect));
    }
    #endif

    if (!sdxx->dc_configured)
    {
    #if _CYHAL_SDHC_IO_VOLT_SEL_PRESENT
        _cyhal_utils_release_if_used(&(sdxx->pin_io_vol_sel));
    #endif

    #if _CYHAL_SDHC_CARD_IF_PWR_EN_PRESENT
        _cyhal_utils_release_if_used(&(obj->pin_card_pwr_en));
    #endif

    #if _CYHAL_SDHC_CARD_WRITE_PROT_PRESENT
        _cyhal_utils_release_if_used(&(obj->pin_card_mech_write_prot));
    #endif

    #if _CYHAL_SDHC_LED_CTRL_PRESENT
        _cyhal_utils_release_if_used(&(obj->pin_led_ctrl));
    #endif

    #if _CYHAL_SDHC_CARD_EMMC_RESET_PRESENT
        _cyhal_utils_release_if_used(&(obj->pin_emmc_reset));
    #endif
    }
}

cy_rslt_t cyhal_sdhc_read(cyhal_sdhc_t *obj, uint32_t address, uint8_t *data, size_t *length)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(_CYHAL_SDXX_NOT_RUNNING == sdxx->data_transfer_status);
    _cyhal_sdxx_setup_smphr(sdxx);
    cy_rslt_t ret = cyhal_sdhc_read_async(obj, address, data, length);
    /* Waiting for async operation to end */
    if (CY_RSLT_SUCCESS == ret)
    {
        ret = _cyhal_sdxx_waitfor_transfer_complete(sdxx);
    }
    if(CY_RSLT_SUCCESS != ret)
    {
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }
    return ret;
}

cy_rslt_t cyhal_sdhc_write(cyhal_sdhc_t *obj, uint32_t address, const uint8_t *data, size_t *length)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(_CYHAL_SDXX_NOT_RUNNING == sdxx->data_transfer_status);
    _cyhal_sdxx_setup_smphr(sdxx);
    cy_rslt_t ret = cyhal_sdhc_write_async(obj, address, data, length);
    /* Waiting for async operation to end */
    if (CY_RSLT_SUCCESS == ret)
    {
        ret = _cyhal_sdxx_waitfor_transfer_complete(sdxx);
    }
    if(CY_RSLT_SUCCESS != ret)
    {
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }
    return ret;
}

cy_rslt_t cyhal_sdhc_erase(cyhal_sdhc_t *obj, uint32_t start_addr, size_t length, uint32_t timeout_ms)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (timeout_ms == 0)
    {
        timeout_ms = sdxx->emmc ? _CYHAL_SDHC_EMMC_TRIM_DELAY_MS : _CYHAL_SDHC_RETRY_TIMES;
    }
    if (sdxx->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    if (0 == length)
    {
        return CYHAL_SDHC_RSLT_ERR_WRONG_PARAM;
    }

    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_en_sd_host_erase_type_t eraseType = CY_SD_HOST_ERASE_ERASE;
    uint32_t cardStatus;

    if (sdxx->emmc)
    {
         eraseType = CY_SD_HOST_ERASE_TRIM;
    }

    /* First clear out the transfer and command complete statuses */
    Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, (CY_SD_HOST_XFER_COMPLETE | CY_SD_HOST_CMD_COMPLETE));

    if (sdxx->irq_cause & CYHAL_SDHC_CMD_COMPLETE)
    {
        /*  Enabling command complete interrupt mask if corresponding event was enabled by user
        *   _cyhal_sdhc_irq_handler will disable CY_SD_HOST_CMD_COMPLETE mask once interrupt
        *   is generated. */
        Cy_SD_Host_SetNormalInterruptMask(sdxx->base, Cy_SD_Host_GetNormalInterruptMask(sdxx->base) |
                CY_SD_HOST_CMD_COMPLETE);
    }

    ret = (cy_rslt_t)Cy_SD_Host_Erase(sdxx->base, start_addr, (start_addr + length - 1), eraseType, &(sdxx->context));

    if (CY_RSLT_SUCCESS == ret)
    {
        uint32_t time_used_ms;
        ret = (cy_rslt_t)_cyhal_sdxx_pollcmdcomplete(sdxx, &time_used_ms);
        timeout_ms = timeout_ms - time_used_ms;
    }
    if (CY_RSLT_SUCCESS == ret)
    {
        if (false == sdxx->emmc)
        {
            /* polling result */
            ret = CYHAL_SDHC_RSLT_ERR_ERASE_CMPLT_TIMEOUT;
            while(timeout_ms > 0)
            {
                cardStatus = Cy_SD_Host_GetCardStatus(sdxx->base, &(sdxx->context));
                if (((CY_SD_HOST_CARD_TRAN << CY_SD_HOST_CMD13_CURRENT_STATE) |
                    (1UL << CY_SD_HOST_CMD13_READY_FOR_DATA)) == cardStatus)
                {
                    ret = CY_RSLT_SUCCESS;
                    break;
                }
                cyhal_system_delay_us(_CYHAL_SDHC_FUJE_TIMEOUT_MS); /* The Fuje timeout for one block. */
                timeout_ms--;
            }
        }
        else
        {
            cyhal_system_delay_ms(timeout_ms);
        }
    }

    return ret;
}

cy_rslt_t cyhal_sdhc_read_async(cyhal_sdhc_t *obj, uint32_t address, uint8_t *data, size_t *length)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (sdxx->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

