zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
uint32_t cyhal_sdhc_get_frequency(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    return obj->bus_frequency_hz;
}

cy_rslt_t cyhal_sdhc_set_data_read_timeout(cyhal_sdhc_t *obj, uint32_t timeout, bool auto_reconfigure)
{
    CY_ASSERT(NULL != obj);

    uint32_t current_card_clock = cyhal_sdhc_get_frequency(obj);

    /* TMCLK works on 1 MHz in current block implementation if corresponding HF clock is 100 MHz.
    *  This is defined in registers (TOUT_CLK_FREQ[5:0] = 1 and TOUT_CLK_UNIT[7] = 1).  */
    float tout_clk_period_us = _CYHAL_SDHC_EXPECTED_BASE_CLK_FREQ_HZ / (float)obj->block_source_freq_hz;

    uint32_t user_needs_us = (((uint64_t)timeout * 1000000) + current_card_clock - 1) / current_card_clock;

    /* Timeout range from 0x0 to 0xE is valid for PSoC™ 6, which corresponds to
    * TMCLK x 2^13 for 0, TMCLK x 2^14 for 1, ..., TMCLK x 2^27 for 0xE. 0xF is reserved. */
    const uint8_t tout_clk_power_base = _CYHAL_SDHC_TOUT_TMCLK_POW_MIN;
    for (uint8_t tmclk_power = tout_clk_power_base; tmclk_power <= _CYHAL_SDHC_TOUT_TMCLK_POW_MAX; tmclk_power++)
    {
        if (tout_clk_period_us * ((uint32_t)1 << tmclk_power) >= user_needs_us)
        {
            obj->data_timeout_tout = tmclk_power - tout_clk_power_base;
            obj->data_timeout_card_clocks_user = timeout;
            obj->data_timeout_auto_reconfig = auto_reconfigure;
            return CY_RSLT_SUCCESS;
        }
    }
    return CYHAL_SDHC_RSLT_ERR_TOUT_CFG;
}

cy_rslt_t cyhal_sdhc_config_data_transfer(cyhal_sdhc_t *obj, cyhal_sdhc_data_config_t *data_config)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != data_config);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(NULL != sdxx->base);

    if (NULL == data_config->data_ptr)
    {
        return CYHAL_SDHC_RSLT_ERR_WRONG_PARAM;
    }

    cy_stc_sd_host_data_config_t dataConfig = {
        .blockSize = data_config->block_size,
        .numberOfBlock = data_config->number_of_blocks,
        .enableDma = true,
        .autoCommand = (cy_en_sd_host_auto_cmd_t)data_config->auto_command,
        .read = data_config->is_read,
        /* .data is skipped to configure adma2 descriptor for it later */
        .dataTimeout = obj->data_timeout_tout,
        .enableIntAtBlockGap = false,
        .enReliableWrite = false
    };

    uint32_t length = data_config->block_size * data_config->number_of_blocks;

    sdxx->adma_descriptor_tbl[0] = (1UL << CY_SD_HOST_ADMA_ATTR_VALID_POS) | /* Attr Valid */
                            (1UL << CY_SD_HOST_ADMA_ATTR_END_POS) |   /* Attr End */
                            (0UL << CY_SD_HOST_ADMA_ATTR_INT_POS) |   /* Attr Int */
                            (CY_SD_HOST_ADMA_TRAN << CY_SD_HOST_ADMA_ACT_POS) |
                            (length << CY_SD_HOST_ADMA_LEN_POS);     /* Len */

    sdxx->adma_descriptor_tbl[1] = (uint32_t)data_config->data_ptr;

    /* The address of the ADMA descriptor table. */
    dataConfig.data = (uint32_t*)&sdxx->adma_descriptor_tbl[0];

    return (cy_rslt_t) Cy_SD_Host_InitDataTransfer(sdxx->base, &dataConfig);
}

cy_rslt_t cyhal_sdhc_send_cmd(cyhal_sdhc_t *obj, cyhal_sdhc_cmd_config_t *cmd_config)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cmd_config);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(NULL != sdxx->base);

    cy_rslt_t result = CY_RSLT_SUCCESS;
    bool cmd_data_present = (NULL != cmd_config->data_config);

    cy_stc_sd_host_cmd_config_t cmd = {
        .commandIndex = cmd_config->command_index,
        .commandArgument = cmd_config->command_argument,
        .enableCrcCheck = cmd_config->enable_crc_check,
        .enableAutoResponseErrorCheck = false,
        .respType = (cy_en_sd_host_response_type_t)cmd_config->response_type,
        .enableIdxCheck = cmd_config->enable_idx_check,
        .dataPresent = cmd_data_present,
        .cmdType = (cy_en_sd_host_cmd_type_t)cmd_config->command_type
    };

    /* First clear out the transfer and command complete statuses */
    Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, (CY_SD_HOST_XFER_COMPLETE | CY_SD_HOST_CMD_COMPLETE));

    if (cmd_data_present)
    {
        result = _cyhal_sdxx_prepare_for_transfer(sdxx);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (cmd_data_present)
        {
            /* Data will be transfered in scope of this command, so setting _CYHAL_SDXX_WAIT_BOTH (cmd and data)
            *  and setting up xfer complete semaphore */
            sdxx->data_transfer_status = _CYHAL_SDXX_WAIT_BOTH;
            _cyhal_sdxx_setup_smphr(sdxx);
        }
        else
        {
            /* No data is transfered in this command, just waiting for cmd to complete */
            sdxx->data_transfer_status = _CYHAL_SDXX_WAIT_CMD_COMPLETE;
        }
        result = (cy_rslt_t)Cy_SD_Host_SendCommand(sdxx->base, &cmd);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = (cy_rslt_t)_cyhal_sdxx_pollcmdcomplete(sdxx, NULL);
    }

    if (CY_RSLT_SUCCESS != result)
    {
        /* Transfer failed */
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }

    return result;
}

cy_rslt_t cyhal_sdhc_get_response(cyhal_sdhc_t *obj, uint32_t *response, bool large_response)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    CY_ASSERT(NULL != response);
    return (cy_rslt_t)Cy_SD_Host_GetResponse(obj->sdxx.base, response, large_response);
}

cy_rslt_t cyhal_sdhc_wait_transfer_complete(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    return _cyhal_sdxx_waitfor_transfer_complete(&(obj->sdxx));
}

static cy_rslt_t _cyhal_sdxx_io_volt_switch_seq(SDHC_Type *base)
{
    CY_ASSERT(NULL != base);

    uint32_t p_state;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Disable providing the SD Clock. */
    Cy_SD_Host_DisableSdClk(base);

    p_state = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

    /* Check DAT[3:0]. */
    if (0UL == p_state)
    {
        /* Switch the bus to 1.8 V (Set the IO_VOLT_SEL pin to low)*/
        Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_1_8V);

        /* Wait 10 ms to 1.8 voltage regulator to be stable. */
        cyhal_system_delay_ms(_CYHAL_SDHC_1_8_REG_STABLE_TIME_MS);

        /* Check the 1.8V signaling enable. */
        if (true == _FLD2BOOL(SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN,
                            SDHC_CORE_HOST_CTRL2_R(base)))
        {
            /* Enable providing the SD Clock. */
            Cy_SD_Host_EnableSdClk(base);

            /* Wait for the stable CLK */
            cyhal_system_delay_ms(CY_SD_HOST_CLK_RAMP_UP_TIME_MS);

            p_state = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

