zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
            /*  Once the card enters 1.8V signaling mode, it cannot be switched back to 3.3V signaling without power cycle. */
            if ((sdxx->low_voltage_io_set) && (_CYHAL_SDXX_IO_VOLTAGE_3_3V == io_voltage))
            {
                result = _cyhal_sdhc_card_power_cycle(sdhc_obj);
                if (CY_RSLT_SUCCESS == result)
                {
                    sdhc_obj->low_voltage_io_desired = false;
                    result = cyhal_sdhc_init_card(sdhc_obj);
                }
            }
            else
            {
                result = _cyhal_sdhc_io_volt_negotiate(sdhc_obj, (cyhal_sdhc_io_voltage_t)io_voltage);
            }

            /* Return back bus width and frequency regardless of volt select change status */
            (void)cyhal_sdhc_set_bus_width(sdhc_obj, sd_bus_width_before_switch, true);
            (void)cyhal_sdhc_set_frequency(sdhc_obj, sd_freq_before_switch, true);
            break;
        }

        case _CYHAL_SDXX_IO_VOLT_ACTION_SWITCH_SEQ_ONLY:
            if (_CYHAL_SDXX_IO_VOLTAGE_1_8V == io_voltage)
            {
                result = _cyhal_sdxx_io_volt_switch_seq(sdxx->base);
                if (CY_RSLT_SUCCESS != result)
                {
                    result = sdxx->is_sdio ? CYHAL_SDHC_RSLT_ERR_IO_VOLT_SWITCH_SEQ : CYHAL_SDIO_RSLT_ERR_IO_VOLT_SWITCH_SEQ;
                }
                break;
            }
            Cy_SD_Host_ChangeIoVoltage(sdxx->base, (cy_en_sd_host_io_voltage_t)io_voltage);
            break;

        case _CYHAL_SDXX_IO_VOLT_ACTION_NONE:
            Cy_SD_Host_ChangeIoVoltage(sdxx->base, (cy_en_sd_host_io_voltage_t)io_voltage);
            break;

        default:
            /* Illegal io_switch_type value provided */
            CY_ASSERT(false);
    }

    return result;
}

cy_rslt_t cyhal_sdhc_set_io_voltage(cyhal_sdhc_t *obj, cyhal_sdhc_io_voltage_t io_voltage, cyhal_sdhc_io_volt_action_type_t io_switch_type)
{
    CY_ASSERT(NULL != obj);

    if (NC == obj->sdxx.pin_io_vol_sel)
    {
        /* Need to have io_volt_sel pin configured in order to switch io voltage */
        return CYHAL_SDHC_RSLT_ERR_PIN;
    }

    return _cyhal_sdxx_set_io_voltage(&(obj->sdxx), (cyhal_sdxx_io_voltage_t)io_voltage,
            (_cyhal_sdxx_io_switch_action_t)io_switch_type);
}

cyhal_sdhc_io_voltage_t cyhal_sdhc_get_io_voltage(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    return obj->sdxx.low_voltage_io_set ? CYHAL_SDHC_IO_VOLTAGE_1_8V : CYHAL_SDHC_IO_VOLTAGE_3_3V;
}

static inline bool _cyhal_sdhc_is_buswidth_correct(uint8_t sd_data_bits)
{
    return ((1 == sd_data_bits) || (4 == sd_data_bits) || (8 == sd_data_bits));
}

cy_rslt_t cyhal_sdhc_set_bus_width(cyhal_sdhc_t *obj, uint8_t bus_width, bool configure_card)
{
    CY_ASSERT(NULL != obj);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(NULL != sdxx->base);

    if (!_cyhal_sdhc_is_buswidth_correct(bus_width))
    {
        return CYHAL_SDHC_RSLT_ERR_WRONG_PARAM;
    }

    cy_rslt_t result;

    if (configure_card)
    {
        result = (cy_rslt_t)Cy_SD_Host_SetBusWidth(sdxx->base, _cyhal_sdhc_buswidth_hal_to_pdl(bus_width), &(sdxx->context));
        if ((CY_RSLT_SUCCESS == result) && (sdxx->emmc))
        {
            /* GENERIC_CMD6_TIME is maximum timeout for a SWITCH command (CMD6), that is called for eMMC in scope of
            *   Cy_SD_Host_SetBusWidth */
            cyhal_system_delay_ms(obj->emmc_generic_cmd6_time_ms);
        }
    }
    else
    {
        result = (cy_rslt_t)Cy_SD_Host_SetHostBusWidth(sdxx->base, _cyhal_sdhc_buswidth_hal_to_pdl(bus_width));
    }

    if (CY_RSLT_SUCCESS == result)
    {
        obj->bus_width = bus_width;
    }

    return result;
}

uint8_t cyhal_sdhc_get_bus_width(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    return obj->bus_width;
}

void cyhal_sdhc_clear_errors(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    Cy_SD_Host_ClearErrorInterruptStatus(obj->sdxx.base, _CYHAL_SDHC_ALL_ERR_INTERRUPTS);
}

cyhal_sdhc_error_type_t cyhal_sdhc_get_last_command_errors(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    return (cyhal_sdhc_error_type_t)Cy_SD_Host_GetErrorInterruptStatus(obj->sdxx.base);
}

void cyhal_sdhc_software_reset(cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    _cyhal_sdxx_reset(&(obj->sdxx));
}

cy_rslt_t cyhal_sdhc_enable_card_power(cyhal_sdhc_t *obj, bool enable)
{
    CY_ASSERT(NULL != obj);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    CY_ASSERT(NULL != sdxx->base);

    if (NC == obj->pin_card_pwr_en)
    {
        /* Need to have card_pwr_en pin configured in order to switch card power state */
        return CYHAL_SDHC_RSLT_ERR_PIN;
    }

    if (enable)
    {
        Cy_SD_Host_EnableCardVoltage(sdxx->base);
    }
    else
    {
        Cy_SD_Host_DisableCardVoltage(sdxx->base);
    }
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t _cyhal_sdio_init_common(cyhal_sdio_t *obj, const cyhal_sdio_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    CY_ASSERT(NULL != cfg->host_config);
    CY_ASSERT(NULL != cfg->card_config);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    sdxx->obj = obj;
    sdxx->is_sdio = true;

    /* Configuration is provided by device configurator */
    sdxx->dc_configured = (cfg->resource != NULL);

    if ((sdxx->dc_configured) &&
            (cfg->host_config->emmc || cfg->host_config->dmaType != CY_SD_HOST_DMA_ADMA2 ||
             cfg->card_config->busWidth != CY_SD_HOST_BUS_WIDTH_4_BIT))
    {
        /*  emmc setting should be false for SDIO.
            Next settings are only supported by SDIO HAL:
                - DMA type : ADMA2
                - Data bus width : 4 bit
        */
        return CYHAL_SDIO_RSLT_ERR_UNSUPPORTED;
    }

    sdxx->resource.type = CYHAL_RSC_INVALID;
    sdxx->base = NULL;
    sdxx->pin_cmd = CYHAL_NC_PIN_VALUE;
    sdxx->pin_clk = CYHAL_NC_PIN_VALUE;
    obj->pin_data0 = CYHAL_NC_PIN_VALUE;
    obj->pin_data1 = CYHAL_NC_PIN_VALUE;
    obj->pin_data2 = CYHAL_NC_PIN_VALUE;
    obj->pin_data3 = CYHAL_NC_PIN_VALUE;
    sdxx->pin_io_vol_sel = CYHAL_NC_PIN_VALUE;

    sdxx->low_voltage_io_set = false;
    sdxx->clock_owned = false;

    cyhal_gpio_t cmd = cfg->gpios.cmd;
    cyhal_gpio_t clk = cfg->gpios.clk;
    cyhal_gpio_t data[4];
    memcpy(data, cfg->gpios.data, sizeof(cfg->gpios.data));

    cy_rslt_t result = _cyhal_sdxx_setup_pin(sdxx, cmd, cyhal_pin_map_sdhc_card_cmd,
        CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_CMD,
        _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_cmd), &(sdxx->pin_cmd), _CYHAL_SDHC_NOT_WEAK_FUNC,
        !sdxx->dc_configured);

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_setup_pin(sdxx, clk, cyhal_pin_map_sdhc_clk_card,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CLK_CARD,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_clk_card), &(sdxx->pin_clk), _CYHAL_SDHC_NOT_WEAK_FUNC,
            !sdxx->dc_configured);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_setup_pin(sdxx, data[0], cyhal_pin_map_sdhc_card_dat_3to0,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_3TO0,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data0), _CYHAL_SDHC_NOT_WEAK_FUNC,
            !sdxx->dc_configured);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_setup_pin(sdxx, data[1], cyhal_pin_map_sdhc_card_dat_3to0,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_3TO0,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data1), _CYHAL_SDHC_NOT_WEAK_FUNC,
            !sdxx->dc_configured);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_setup_pin(sdxx, data[2], cyhal_pin_map_sdhc_card_dat_3to0,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_3TO0,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data2), _CYHAL_SDHC_NOT_WEAK_FUNC,
            !sdxx->dc_configured);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_setup_pin(sdxx, data[3], cyhal_pin_map_sdhc_card_dat_3to0,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_3TO0,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data3), _CYHAL_SDHC_NOT_WEAK_FUNC,
            !sdxx->dc_configured);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        const cyhal_resource_pin_mapping_t *cmd_map = _CYHAL_UTILS_GET_RESOURCE(cmd, cyhal_pin_map_sdhc_card_cmd);
        cyhal_resource_inst_t sdhc = { CYHAL_RSC_SDHC, cmd_map->block_num, cmd_map->channel_num };

