zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
        _cyhal_sdxx_config_structs[sdxx->resource.block_num] = NULL;
        _cyhal_syspm_unregister_peripheral_callback(&(sdxx->pm_callback_data));
    }

    if (sdxx->resource.type != CYHAL_RSC_INVALID)
    {
        sdxx->resource.type = CYHAL_RSC_INVALID;
    }

    if (sdxx->clock_owned)
    {
        cyhal_clock_free(&(sdxx->clock));
        sdxx->clock_owned = false;
    }

    if (!sdxx->dc_configured)
    {
        /* Free pins */
        _cyhal_utils_release_if_used(&(sdxx->pin_clk));
        _cyhal_utils_release_if_used(&(sdxx->pin_cmd));
        _cyhal_utils_release_if_used(&obj->pin_data0);
        _cyhal_utils_release_if_used(&obj->pin_data1);
        _cyhal_utils_release_if_used(&obj->pin_data2);
        _cyhal_utils_release_if_used(&obj->pin_data3);
    }
}

cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t *obj, const cyhal_sdio_cfg_t *config)
{
    cy_rslt_t result = CYHAL_SDIO_RSLT_ERR_CONFIG;

    if ((NULL == obj) || (config == NULL))
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (config->frequencyhal_hz != 0U)
    {
        uint32_t freq = config->frequencyhal_hz;
        result = _cyhal_sdxx_sdcardchangeclock(sdxx, &freq, sdxx->low_voltage_io_set, false);
        if (CY_RSLT_SUCCESS == result)
        {
            obj->frequencyhal_hz = freq;
        }
    }

    if (config->block_size != 0U)
    {
        /* No need to change anything in HW, because it will be overwritten
        *  in cyhal_sdio_bulk_transfer()/cyhal_sdio_transfer_async() functions.
        *  The HW block size will taken based on obj->block_size, which is
        *  updated here.
        */
        obj->block_size = config->block_size;
    }

    return result;
}

cy_rslt_t cyhal_sdio_send_cmd(cyhal_sdio_t *obj, cyhal_sdio_transfer_type_t direction, \
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    CY_UNUSED_PARAMETER(direction);
    if (NULL == obj)
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (sdxx->pm_transition_pending)
    {
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    cy_rslt_t                   ret;
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    retry = _CYHAL_SDIO_TRANSFER_TRIES;

    /* Clear out the response */
    if ( response != NULL )
    {
        *response = 0UL;
    }

    do
    {
        /* First clear out the command complete and transfer complete statuses */
        Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, CY_SD_HOST_CMD_COMPLETE);

        /* Check if an error occurred on any previous transactions */
        if ( Cy_SD_Host_GetNormalInterruptStatus(sdxx->base) & CY_SD_HOST_ERR_INTERRUPT )
        {
            /* Reset the block if there was an error. Note a full reset usually
             * requires more time, but this short version is working quite well and
             * successfully clears out the error state.
             */
            Cy_SD_Host_ClearErrorInterruptStatus(sdxx->base, _CYHAL_SDIO_SET_ALL_INTERRUPTS_MASK);
            _cyhal_sdxx_reset(sdxx);
        }

        cmd.commandIndex                 = (uint32_t)command;
        cmd.commandArgument              = argument;
        cmd.enableCrcCheck               = true;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType                     = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableIdxCheck               = true;
        cmd.dataPresent                  = false;
        cmd.cmdType                      = CY_SD_HOST_CMD_NORMAL;

        if (sdxx->irq_cause & CYHAL_SDIO_CMD_COMPLETE)
        {
            /*  Enabling command complete interrupt mask if corresponding event was enabled by user
            *   _cyhal_sdio_irq_handler will disable CY_SD_HOST_CMD_COMPLETE mask once interrupt
            *   is generated. */
            Cy_SD_Host_SetNormalInterruptMask(sdxx->base, Cy_SD_Host_GetNormalInterruptMask(sdxx->base) |
                    CY_SD_HOST_CMD_COMPLETE);
        }

        ret = (cy_rslt_t)Cy_SD_Host_SendCommand(sdxx->base, &cmd);

        if (CY_RSLT_SUCCESS == ret)
        {
            ret = (cy_rslt_t)_cyhal_sdxx_pollcmdcomplete(sdxx, NULL);
        }
    } while ((CY_RSLT_SUCCESS != ret) && (retry-- > 0UL));

    if (CY_RSLT_SUCCESS == ret)
    {
        ret = (cy_rslt_t)Cy_SD_Host_GetResponse(sdxx->base, response, false);
    }

    return ret;
}

cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t *obj, cyhal_sdio_transfer_type_t direction,
                                   uint32_t argument, const uint32_t* data,
                                   uint16_t length, uint32_t* response)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    uint32_t retry = _CYHAL_SDIO_TRANSFER_TRIES;

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    _cyhal_sdxx_setup_smphr(sdxx);

    do
    {
        ret = cyhal_sdio_transfer_async(obj, direction, argument, data, length);

        if (CY_RSLT_SUCCESS == ret)
        {
            ret = _cyhal_sdxx_waitfor_transfer_complete(sdxx);
        }

        if (CY_RSLT_SUCCESS != ret)
        {
            /*  SDIO Error Handling
            *   SDIO write timeout is expected when doing first write to register
            *   after KSO bit disable (as it goes to AOS core).
            *   This is the only time known that a write timeout occurs.
            *   Issue the reset to recover from error. */
            _cyhal_sdxx_reset(sdxx);
        }

    } while ((CY_RSLT_SUCCESS != ret) && (--retry > 0UL));

    if(CY_RSLT_SUCCESS != ret)
    {
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }

    if ((response != NULL) && (CY_RSLT_SUCCESS == ret))
    {
        *response = 0UL;
        ret = (cy_rslt_t)Cy_SD_Host_GetResponse(sdxx->base, response, false);
    }

    return ret;
}

/*******************************************************************************
*
*   The asynchronous transfer is implemented on the CY_SD_HOST_XFER_COMPLETE
*   interrupt. The function sets up data and enables the CY_SD_HOST_XFER_COMPLETE
*   interrupt mask, which causes interrupt to occur and handled by _cyhal_sdio_irq_handler
*   which take care of disabling CY_SD_HOST_XFER_COMPLETE mask. This function
*   can also activate CY_SD_HOST_CMD_COMPLETE interrupt mask if it was enabled
*   by user via cyhal_sdio_enable_event function.
*
*******************************************************************************/
cy_rslt_t cyhal_sdio_transfer_async(cyhal_sdio_t *obj, cyhal_sdio_transfer_type_t direction,
                                    uint32_t argument, const uint32_t* data, uint16_t length)
{
    if (NULL == obj)
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

