zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_sdhc.c
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (sdxx->pm_transition_pending)
    {
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    cy_rslt_t                    ret;
    uint32_t                     retry = _CYHAL_SDIO_TRANSFER_TRIES;
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dat;

    /* Initialize data constants*/
    dat.autoCommand         = CY_SD_HOST_AUTO_CMD_NONE;
    dat.dataTimeout         = 0x0dUL;
    dat.enableIntAtBlockGap = false;
    dat.enReliableWrite     = false;
    dat.enableDma           = true;

    do
    {
        /* Add SDIO Error Handling
        * SDIO write timeout is expected when doing first write to register
        * after KSO bit disable (as it goes to AOS core).
        * This timeout, however, triggers an error state in the hardware.
        * So, check for the error and then recover from it
        * as needed via reset issuance. This is the only time known that
        * a write timeout occurs.
        */

        /* First clear out the command complete and transfer complete statuses */
        Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, (CY_SD_HOST_XFER_COMPLETE | CY_SD_HOST_CMD_COMPLETE));

        /* Check if an error occurred on any previous transactions or reset after the first unsuccessful transfer try */
        if ((Cy_SD_Host_GetNormalInterruptStatus(sdxx->base) & CY_SD_HOST_ERR_INTERRUPT) ||
            (retry < _CYHAL_SDIO_TRANSFER_TRIES))
        {
            /* Reset the block if there was an error. Note a full reset usually
             * requires more time, but this short version is working quite well and
             * successfully clears out the error state.
             */
            Cy_SD_Host_ClearErrorInterruptStatus(sdxx->base, _CYHAL_SDIO_SET_ALL_INTERRUPTS_MASK);
            _cyhal_sdxx_reset(sdxx);
        }

        /* Prepare the data transfer register */
        cmd.commandIndex                 = (uint32_t) CYHAL_SDIO_CMD_IO_RW_EXTENDED;
        cmd.commandArgument              = argument;
        cmd.enableCrcCheck               = true;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType                     = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableIdxCheck               = true;
        cmd.dataPresent                  = true;
        cmd.cmdType                      = CY_SD_HOST_CMD_NORMAL;

        dat.read = ( direction == CYHAL_SDIO_XFER_TYPE_WRITE ) ? false : true;

        /* Block mode */
        if (length >= obj->block_size)
        {
            dat.blockSize     = obj->block_size;
            dat.numberOfBlock = ( length + obj->block_size - 1 ) / obj->block_size;
        }
        /* Byte mode */
        else
        {
            dat.blockSize     = length;
            dat.numberOfBlock = 1UL;
        }

        length = dat.blockSize * dat.numberOfBlock;

        sdxx->adma_descriptor_tbl[0] = (1UL << CY_SD_HOST_ADMA_ATTR_VALID_POS) | /* Attr Valid */
                                       (1UL << CY_SD_HOST_ADMA_ATTR_END_POS) |   /* Attr End */
                                       (0UL << CY_SD_HOST_ADMA_ATTR_INT_POS) |   /* Attr Int */
                                       (CY_SD_HOST_ADMA_TRAN << CY_SD_HOST_ADMA_ACT_POS) |
                                       ((uint32_t)length << CY_SD_HOST_ADMA_LEN_POS);     /* Len */

        sdxx->adma_descriptor_tbl[1] = (uint32_t)data;

        /* The address of the ADMA descriptor table. */
        dat.data = (uint32_t*)&(sdxx->adma_descriptor_tbl[0]);

        ret = _cyhal_sdxx_prepare_for_transfer(sdxx);

        if (CY_RSLT_SUCCESS == ret)
        {
            ret = (cy_rslt_t)Cy_SD_Host_InitDataTransfer(sdxx->base, &dat);
        }

        if (CY_RSLT_SUCCESS == ret)
        {
            /* Indicate that async transfer in progress */
            sdxx->data_transfer_status = _CYHAL_SDXX_WAIT_BOTH;
            ret = (cy_rslt_t)Cy_SD_Host_SendCommand(sdxx->base, &cmd);
        }

        if (CY_RSLT_SUCCESS == ret)
        {
            ret = (cy_rslt_t)_cyhal_sdxx_pollcmdcomplete(sdxx, NULL);
        }

    } while ((CY_RSLT_SUCCESS != ret) && (--retry > 0UL));

    if (CY_RSLT_SUCCESS != ret)
    {
        /* Transfer failed */
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }

    return ret;
}

bool cyhal_sdio_is_busy(const cyhal_sdio_t *obj)
{
    CY_ASSERT(NULL != obj);
    return _cyhal_sdio_is_busy(&(obj->sdxx));
}

cy_rslt_t cyhal_sdio_abort_async(cyhal_sdio_t *obj)
{
    cy_rslt_t ret = CY_RSLT_SUCCESS;

    /* To abort transition reset dat and cmd lines (software reset) */
    _cyhal_sdxx_reset(&(obj->sdxx));
    obj->sdxx.data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    return ret;
}

void cyhal_sdio_register_callback(cyhal_sdio_t *obj, cyhal_sdio_event_callback_t callback, void *callback_arg)
{
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->sdxx.callback_data.callback = (cy_israddress) callback;
    obj->sdxx.callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_sdio_enable_event(cyhal_sdio_t *obj, cyhal_sdio_event_t event, uint8_t intr_priority, bool enable)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    /* Configure interrupt-based event(s) */
    if (0U != ((uint32_t) event & (uint32_t) CYHAL_SDIO_ALL_INTERRUPTS))
    {
        uint32_t cur_interrupt_mask = Cy_SD_Host_GetNormalInterruptMask(sdxx->base);
        uint32_t new_interrupt_mask = cur_interrupt_mask;

        IRQn_Type irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
        NVIC_SetPriority(irqn, intr_priority);

        if (enable)
        {
            sdxx->irq_cause |= event;

            /*  CY_SD_HOST_CMD_COMPLETE and CY_SD_HOST_XFER_COMPLETE cannot be always enabled because of SD Host driver limitations.
            *   SDHC HAL transfer APIs are taking care of enabling these statuses. CY_SD_HOST_CMD_COMPLETE is only
            *   enabled if corresponding user callback is enabled while CY_SD_HOST_XFER_COMPLETE is enabled by transfer API
            *   regardless it was enabled by user or not. */
            event &= ((uint32_t) ~CY_SD_HOST_CMD_COMPLETE) & ((uint32_t) ~CY_SD_HOST_XFER_COMPLETE);

            new_interrupt_mask |= event;
            Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, new_interrupt_mask & ~cur_interrupt_mask);
        }
        else
        {
            new_interrupt_mask &= ~(event);
            sdxx->irq_cause &= ~event;
        }

        Cy_SD_Host_SetNormalInterruptMask(sdxx->base, new_interrupt_mask);
    }

